{
    "version": "https://jsonfeed.org/version/1",
    "title": "Fodi makes games",
    "description": "",
    "home_page_url": "https://gamedev.fodi.be",
    "feed_url": "https://gamedev.fodi.be/feed.json",
    "user_comment": "",
    "author": {
        "name": "Fodi"
    },
    "items": [
        {
            "id": "https://gamedev.fodi.be/adventures-of-antennio/",
            "url": "https://gamedev.fodi.be/adventures-of-antennio/",
            "title": "Adventures of Antennio (HEJ 2024 August jam)",
            "summary": "<p>A physics platformer where you swing from tree to tree, collect energy crystals and sometimes you fall back a bit. Or a lot.</p>\n",
            "content_html": "<p>A physics platformer where you swing from tree to tree, collect energy crystals and sometimes you fall back a bit. Or a lot.</p>\n\n<p>Since the quite famous <a href=\"https://itch.io/jam/gmtk-2024\" target=\"_blank\" rel=\"noopener noreferrer\">GMTK Jam</a> was happening in August 2024, the organizers of the HEJ (\"one game a month\") Jam decided that one of the three themes for the month should be whatever the GMTK theme turns out to be. And it turned out to be quite a good one: <strong>built to scale</strong>. After it was published we started making a prototype with the intention of submitting the game to both jams, but then stuff happened and we couldn't make the GMTK Jam's deadline. Oh well.</p>\n<p>As quite a few other attendees, we interpreted the \"scale\" part of the theme as scaling a mountain and fairly quickly landed on the idea of making another 2D physics platformer. We <a href=\"https://gamedev.fodi.be/attractaball-hej-2024-march-jam/\">kinda like this sort of thing</a>.</p>\n<p>I unearthed some old doodles and found one called \"ninja rod\" which had a wonky mechanic similar to the ninja rope in good old Worms, except it didn't behave like a flexible rope, but more like solid bar. It seemed like a fun concept, so we figured that the player character should be some kind of robot which can use an extendable antenna as a grappling tool. Thus the character of Antennio was born.</p>\n<p>We kept the rest of it quite simple: you have to collect items (energy crystals), avoid some hazards (water) and get to an exit. We added a some checkpoints too so after a big fall you have to option to go back to one. We wanted to spare players from a <a href=\"https://www.youtube.com/watch?v=8qGCleYV4cw\" target=\"_blank\" rel=\"noopener noreferrer\">Getting Over It</a>-like experience :)</p>\n<p>As August was a busy month for us, we couldn't add as much content and polish as we'd liked, but submitted the prototype in a playable and I guess.. acceptable condition. If you'd like to give it a go, you can find it <a href=\"https://lasermagnet.itch.io/antennio\" target=\"_blank\" rel=\"noopener noreferrer\">on Itch</a>. All graphics and level design was made by Tibor, and I did the programming as usual. Unfortunately we didn't have time to add audio or touch input either, so you'll have to use a keyboard or a gamepad to play this.</p>",
            "image": "https://gamedev.fodi.be/media/posts/58/adventures-of-antennio.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Prototype phase",
                   "Projects",
                   "2024"
            ],
            "date_published": "2024-11-13T17:20:06+01:00",
            "date_modified": "2024-11-13T17:46:40+01:00"
        },
        {
            "id": "https://gamedev.fodi.be/geospotting/",
            "url": "https://gamedev.fodi.be/geospotting/",
            "title": "Geospotting",
            "summary": "<p>A mobile game somewhere between geocaching, GeoGuessr and Pokemon Go. One that requires players to walk around in a real city. Békéscsaba, Hungary to be exact.</p>\n",
            "content_html": "<p>A mobile game somewhere between geocaching, GeoGuessr and Pokemon Go. One that requires players to walk around in a real city. Békéscsaba, Hungary to be exact.</p>\n\n<p>Back in the 2010s I was co-organizer of number of community events aimed at secondary schoolers in my hometown Békéscsaba. In 2017 an event called Rongyoló (hard to translate, but the pun was the inclusion of the word \"yolo\" in it), a student organized mini festival of sorts with live concerts and various activities across a few days. One of those activities was a game I designed, where small teams had 90 minutes to frantically run around and find real locations in the city based on clues (semi-cryptic titles and photos taken at the target location). Every team had to use an Android app (made with Cordova) running on their phones to view the clues, then they had to plan their route and then finally go to the locations. The app showed the current distance of each target (also a clue in itself) and when a team managed to get within 15 meters of one, a \"Found it!\" button popped up, which they could press to get points for finding the right place. They also had the option to get an extra clue for hard to find targets by pressing a hint button, but this also meant that they'll only get half of the original point reward for that target if they manage to find it.</p>\n<p>Back then it was less common for every secondary schooler to have mobile Internet connectivity on their phones, so I designed the game to work 100% offline after installation, every asset was included in the initial download. When the 90 minute timer expired, the app switched to an end-game mode, so it wasn't possible to collect more points and every team had to head back to HQ. In this mode the app showed a QR code containing an encrypted array of found targets and their point values, plus the maximum velocity recorded during the hunt (it was forbidden to use motorized vehicles, so I figured why not add this little telemetry). I used a separate app to read &amp; decrypt the contents of the QR codes, then I compiled the end results. Top teams got some small prizes and of course, bragging rights. It was fun to make and according to the participants, fun to play.</p>\n<p>In 2022 I wanted to resurrect the project and rewrote most of the player app using Onsen UI (I figured it should be a PWA instead of an app, so iPhone users can participate as well), but then procrastination got the best of me.</p>\n<p>Then in the spring of 2024 the idea resurfaced and got some traction after I presented it for a local youth club and we decided to make another one-off game event in September 2024. I changed the name to \"Geospotting\" then rewrote the app in Construct 3 (of course) in August, removed targets that weren't there anymore (hey, it's been 7 years) and with some help of a co-organizer of the event also added some more too. The final version contained 70 targets with one photo and one text clue each, and we allowed bigger teams to participate during the 2 hour \"hunt\". Teams could also split up this time and use more then one phone, so I wrote a little app that summarized the data by team so it wasn't possible to get points if a team found a clue more then once.</p>\n<p>After the event I made a public version of Geospotting, which you can find on <a href=\"https://geospotting.net/\" target=\"_blank\" rel=\"noopener noreferrer\">geospotting.net</a>. Again, playing it requires visiting my lovely hometown of Békéscsaba, Hungary, but on the off chance that's manageable for you, by all means give the game a go. And if not, you can still look at the picture clues :)</p>",
            "image": "https://gamedev.fodi.be/media/posts/57/geospotting.jpg",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Prototype phase",
                   "Projects",
                   "2024"
            ],
            "date_published": "2024-11-11T17:32:10+01:00",
            "date_modified": "2024-11-13T17:19:52+01:00"
        },
        {
            "id": "https://gamedev.fodi.be/maths-hej-2024-july-jam/",
            "url": "https://gamedev.fodi.be/maths-hej-2024-july-jam/",
            "title": "M4+H5 (HEJ 2024 July jam)",
            "summary": "<p>M4+H5 (or \"MATHS\") is a very simple puzzle game with addition, subtraction and multiplication. Can you tell if we've struggled with naming again?</p>\n",
            "content_html": "<p>M4+H5 (or \"MATHS\") is a very simple puzzle game with addition, subtraction and multiplication. Can you tell if we've struggled with naming again?</p>\n\n<p>Although the themes for the <a href=\"https://itch.io/jam/hej-2024-julius\" target=\"_blank\" rel=\"noopener noreferrer\">HEJ 2024 July jam</a> sounded quite good (based on a movie, 1D+2D+3D, festival), we somehow didn't feel any of them and a few days before the deadline I reached into the idea drawer (mostly Google Keep) and dug out this little number (sorry): a simple maths puzzle, in which the player has to connect numbered tiles to come up with sums (by addition, substraction multiplication) for specified, definitely existing target numbers.</p>\n<p>It's a bit of a stretch, but we figured that by making the level layout customizable (allowing one and two dimensional levels) and adding a fake 3D look would cut it... it's not great, but technically fits the 1D+2D+3D theme.</p>\n<p>The game plays okay on desktop and mobile as well. If you like this sort of thing, you can try it on <a href=\"https://lasermagnet.itch.io/m4th5\" target=\"_blank\" rel=\"noopener noreferrer\">Itch</a> or on <a href=\"https://play.lasermagnet.com/MATHS/\" target=\"_blank\" rel=\"noopener noreferrer\">Lasermagnet.com</a>, where it's also quite easy to \"install\" the game on your home screen using Chrome on Android or Safari on Apple devices.</p>",
            "image": "https://gamedev.fodi.be/media/posts/56/maths.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Prototype phase",
                   "Projects",
                   "2024"
            ],
            "date_published": "2024-09-11T19:01:36+02:00",
            "date_modified": "2024-11-11T16:42:01+01:00"
        },
        {
            "id": "https://gamedev.fodi.be/hedges-of-hell-hej-2024-june-jam/",
            "url": "https://gamedev.fodi.be/hedges-of-hell-hej-2024-june-jam/",
            "title": "Hedges of Hell (HEJ 2024 June jam)",
            "summary": "<p>Fond memories of playing Doom, Heretic and Hexen finally inspired us to make an old school FPS with Doom '16-style lock-in arena mechanics.</p>\n",
            "content_html": "<p>Fond memories of playing Doom, Heretic and Hexen finally inspired us to make an old school FPS with Doom '16-style lock-in arena mechanics.</p>\n\n<p>We started working on the project specifically for the HEJ 2024 June jam as the themes \"blind\" and \"navigate\" sounded like good fits for an older idea we had: making a top-down dungeon crawler action game where you can only see one room at a time, but you can traverse dungeon walls (doors are boring anyway) to go the the next one, with the possibility of encountering a very sticky situation that you can't possibly anticipate.</p>\n<p>I also thought that this could be a good opportunity to finally utilize the amazing <a href=\"https://gfredericks.com/things/polyominoes\" target=\"_blank\" rel=\"noopener noreferrer\">Polyomino Tiler</a> by Gary Fredericks to generate interesting dungeon layouts using polyominos. I wrote a little <a href=\"https://gist.github.com/fodi/7383be96b95e97d3fff065c58d2d7e9c\" target=\"_blank\" rel=\"noopener noreferrer\">JS snippet</a> that exports the generated tile layout to a JSON string that I could import to Construct and started experimenting. After a while I figured that \"static\" pre-generated tiled polyomino levels were good, but unifying some of the polyomino shapes randomly every time was even better: this way the level actually changes every time the game is restarted, even though it's always the same polyomino \"base map\", and sometimes the random unification results in big arenas and/or long corridors, which is quite cool. On an unrelated note I also discovered that changing the field of view has a very cool zoom-like effect.</p>\n<p><a href=\"https://www.youtube.com/watch?v=hyyhUg9eKpk\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/hyyhUg9eKpk\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>\n<p>At one point we made the decision to turn the game into an FPS and use a hedge maze setting, <a href=\"https://teebor9.itch.io\" target=\"_blank\" rel=\"noopener noreferrer\">Tibor</a> started working on the environment and enemy assets and finally <a href=\"https://lasermagnet.itch.io/hedges-of-hell\" target=\"_blank\" rel=\"noopener noreferrer\">Hedges of Hell</a> was born. After the jam's deadline we continued updating the game for a few more weeks, I streamed one of the sessions <a href=\"https://www.twitch.tv/fodi_gamedev\" target=\"_blank\" rel=\"noopener noreferrer\">on my Twitch channel</a>.</p>\n<p><a href=\"https://www.youtube.com/watch?v=jNSGgB4GE0M\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/jNSGgB4GE0M\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>",
            "image": "https://gamedev.fodi.be/media/posts/55/hedges-of-hell.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Prototype phase",
                   "Projects",
                   "2024"
            ],
            "date_published": "2024-09-10T12:38:22+02:00",
            "date_modified": "2024-09-11T19:05:52+02:00"
        },
        {
            "id": "https://gamedev.fodi.be/shortfall-trijam-270-hej-2024-april-jam/",
            "url": "https://gamedev.fodi.be/shortfall-trijam-270-hej-2024-april-jam/",
            "title": "Shortfall (Trijam #270 / HEJ 2024 May jam)",
            "summary": "<p>The short story of a 5-hour Trijam game (khmm, overtime) that turned into something bigger.</p>\n",
            "content_html": "<p>The short story of a 5-hour Trijam game (khmm, overtime) that turned into something bigger.</p>\n\n<p>Maybe making games similar to Vampire Survivors is cliché nowadays, but I'm not known to give any dangs about such things. So when I saw the theme for <a href=\"https://itch.io/jam/trijam-270\" target=\"_blank\" rel=\"noopener noreferrer\">Trijam #270</a> (\"in the zone\"), I felt that it was time I've made one.</p>\n<p>Even though I <em>kinda</em> managed to reach the playable state at the 3 hour mark, I opted to go overtime, since I had a bunch of important items on my todo list. This time I streamed the entire development (apart from the \"planning\" phase which consisted of making a half-assed todo list and gathering some 3rd party assets), the VOD is up on YouTube if anyone's interested in this sort of thing:</p>\n<p><a href=\"https://www.youtube.com/watch?v=EULOvlYy-aQ\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/EULOvlYy-aQ\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>\n<p>What I miserably failed at is naming the game properly (typical Fodi crap, when I get stuck with naming I get <em>really</em> stuck), so the entry was anti-titled <a href=\"https://fodi.itch.io/trijam-270\" target=\"_blank\" rel=\"noopener noreferrer\">Something Something Zones Something</a>, very much reusing the <a href=\"https://www.youtube.com/watch?v=0oGMbAIcXCQ\" target=\"_blank\" rel=\"noopener noreferrer\">Family Guy reference</a> that I already used in a similar situation (for the Ludum Dare jam game <a href=\"https://lasermagnet.itch.io/ludum-dare-53-jam-version\" target=\"_blank\" rel=\"noopener noreferrer\">Something Something Delivery Something</a>). Oh well :)</p>\n<p>After finding the game (both the development and the gameplay) way too much fun, we opted to build upon it and submit the result for the Hungarian <a href=\"https://itch.io/jam/hej-2024-majus/entries\" target=\"_blank\" rel=\"noopener noreferrer\">HEJ (Havi Egy Játék / One Game a Month) jam</a>. That's how Shortfall came to be. I even updated it for like two weeks after the jam based on the enormously useful feedback we received (thanks to everyone who participated!), which is not my usual modus operandi.</p>\n<p>I streamed some of the development on the 2nd of July:</p>\n<p><a href=\"https://www.youtube.com/watch?v=aCEKdqwr_Kc\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/aCEKdqwr_Kc\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>\n<p>And a bit on the 7th as well:</p>\n<p><a href=\"https://www.youtube.com/watch?v=o9FcpLyk62s\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/o9FcpLyk62s\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>\n<p>I'd also like to say thanks to the amazing <strong>GrafxKid</strong> for the amazing free assets I used (Tibor was <a href=\"https://www.reddit.com/r/HalfLife/comments/1e4wgol/combine_overwatch_soldier_cosplay_self/\" target=\"_blank\" rel=\"noopener noreferrer\">very much occupied with other things this month</a>). Be sure to check 'em out on <a href=\"https://grafxkid.itch.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Itch</a>!</p>\n<p>As you may or may not know, my goal for 2024 is to make at least 12 video game prototypes and next year choose one and turn it into an actual full-fledged Steam release. Shortfall is very much on the shortlist (pun intended) for this, along with <a href=\"https://lasermagnet.itch.io/attractaball\" target=\"_blank\" rel=\"noopener noreferrer\">Attractaball</a> and <a href=\"https://lasermagnet.itch.io/hedges-of-hell\" target=\"_blank\" rel=\"noopener noreferrer\">Hedges of Hell</a> which is the topic of my next blog post if I'm not too lazy to write it :)</p>\n<p>You can try the latest build of <a href=\"https://lasermagnet.itch.io/shortfall\" target=\"_blank\" rel=\"noopener noreferrer\">Shortfall on Itch</a> (per usual). It runs okay on mobile and supports gamepad controls too, but I highly recommend using the keyboard + mouse control scheme. One warning though: if you have motion sickness, you might find the turning mechanic a bit uneasy; the game is playable without it, but then again you might as well play Vampire Survivors :D</p>",
            "image": "https://gamedev.fodi.be/media/posts/54/shortfall-screen2.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Prototype phase",
                   "Projects",
                   "2024"
            ],
            "date_published": "2024-07-08T14:19:56+02:00",
            "date_modified": "2024-09-10T12:49:22+02:00"
        },
        {
            "id": "https://gamedev.fodi.be/recoupage-hej-2024-march-jam/",
            "url": "https://gamedev.fodi.be/recoupage-hej-2024-march-jam/",
            "title": "reCoupage (HEJ 2024 April jam)",
            "summary": "<p>Our third HEJ jam game was a tiling puzzle game based on famous paintings (that explode!).</p>\n",
            "content_html": "<p>Our third HEJ jam game was a tiling puzzle game based on famous paintings (that explode!).</p>\n\n<p>A few days before starting the project I did some ground work and tested a few open source JavaScript libraries that I needed to integrate: one for pixel-by-pixel comparison of images (so the game can detect when the player has successfully restored the original painting and can also show a percentage of how close they are at any moment), and one for rectangular bin packing (so the shapes making up the painting could \"explode\" and move to random positions inside a designated container without overlapping). The \"winning\" libraries were <a href=\"https://github.com/mapbox/pixelmatch/\" target=\"_blank\" rel=\"noopener noreferrer\">Pixelmatch</a> and <a href=\"https://github.com/soimy/maxrects-packer\" target=\"_blank\" rel=\"noopener noreferrer\">Max Rects Packer</a> respectively, they were both super simple to work with (kudos!). I even made a basic Construct 3 template utilizing Pixelmatch - if anyone is interested, <a href=\"https://github.com/fodi/construct-3-projects/tree/main/projectfolders\" target=\"_blank\" rel=\"noopener noreferrer\">it's available on my GitHub</a>.</p>\n<p>Still cutting it relatively close to the deadline, I started prototyping reCoupage at around 4 PM on the 1st of May, 6 days before the deadline. It was a super fun and productive first session and at 1AM (yep, flow happened) the proof of concept version was done: it had one puzzle based on a constructivist painting by Sándor Bortynik. It looked like this (in the \"exploded\" state):</p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://gamedev.fodi.be/media/posts/53/recoupage-day1.png\" alt=\"\" width=\"1920\" height=\"1080\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://gamedev.fodi.be/media/posts/53/responsive/recoupage-day1-xs.png 300w ,https://gamedev.fodi.be/media/posts/53/responsive/recoupage-day1-sm.png 480w ,https://gamedev.fodi.be/media/posts/53/responsive/recoupage-day1-md.png 768w\"></figure>\n<p>The player's task is to move all pieces back to the canvas by dragging them with the mouse and rotating them with right click. To facilitate that, all shapes snap to a fixed grid and rotate in 30 degree angles. For reference, there's a snapshot of the original painting in the bottom right corner.</p>\n<p>I continued development on the 5th of May live on stream, after a lengthy overview I proceeded with feature development, while Tibor was working on new levels:</p>\n<p><a href=\"https://www.youtube.com/watch?v=IhDGRpxMzj4\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/IhDGRpxMzj4\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>\n<p>On the next day I managed to squeeze in another 4 hours of development, and on the day of the jam's deadline another 3 hours on stream</p>\n<p><a href=\"https://www.youtube.com/watch?v=5GetlJAMvZk\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/5GetlJAMvZk\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>\n<p>...and another 4 hours off-stream (mostly taking care of the UI, audio &amp; playtesting). The final result can be played on <a href=\"https://lasermagnet.itch.io/recoupage\" target=\"_blank\" rel=\"noopener noreferrer\">Itch</a> - so far there were a couple of minor post-jam updates based on feedback we received:</p>\n<div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"552\" height=\"167\" frameborder=\"0\" src=\"https://itch.io/embed/2691508?linkback=true\"><a href=\"https://lasermagnet.itch.io/recoupage\">Recoupage by Lasermagnet Games, Fodi, Teebor9</a></iframe></div>\n<p>If you'd prefer just watching how the game works instead of playing it, here's a video of <a href=\"https://store.steampowered.com/app/2731590/Block_Shop/\" target=\"_blank\" rel=\"noopener noreferrer\">fellow game developer</a> and super nice human person <a href=\"https://www.twitch.tv/foolbox\" target=\"_blank\" rel=\"noopener noreferrer\">Foolbox</a> giving it a go:</p>\n<p><a href=\"https://www.youtube.com/watch?v=hKgWZk51IBY\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/hKgWZk51IBY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>",
            "image": "https://gamedev.fodi.be/media/posts/53/recoupage.jpg",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Prototype phase",
                   "Projects",
                   "2024"
            ],
            "date_published": "2024-05-23T18:41:30+02:00",
            "date_modified": "2024-07-08T14:17:41+02:00"
        },
        {
            "id": "https://gamedev.fodi.be/untitled-digging-game-trijam-267/",
            "url": "https://gamedev.fodi.be/untitled-digging-game-trijam-267/",
            "title": "Untitled Digging Game (TriJam #267)",
            "summary": "<p>Hello, and welcome back to the latest episode of How (not) to TriJam with your host: me.</p>\n",
            "content_html": "<p>Hello, and welcome back to the latest episode of How (not) to TriJam with your host: me.</p>\n\n<p>I spent the last weekend of April in decision fatigue land. I wanted make a short jam game, so I did the usual thing on Saturday: I went through the currently running <a href=\"https://itch.io/jams\" target=\"_blank\" rel=\"noopener noreferrer\">jams on Itch.io</a> looking for ones with interesting themes / restrictions and started ideation. By afternoon I was sure that I wasn't going to start actual development, so I figured maybe collecting some assets will help me get started on Sunday.</p>\n<p>It didn't. I couldn't decide on what to make and ended up watching <a href=\"https://www.twitch.tv/2nerdynerds\">2NerdyNerds on Twitch</a> instead (which is my absolute favourite gamedev stream by the way, check them out!). A fun time, but I really wasn't happy about \"skipping gamedev practice\".</p>\n<p>On Monday I woke up around 6 AM and immediately decided I'm going to fix things. I quickly went through my morning routine, made a todo list and cycled to the office with the intention of making a \"last minute\" entry for TriJam, since the deadline is always on Monday at 11 AM. A little after 8 AM I started streaming and did this:</p>\n<p><a href=\"https://www.youtube.com/watch?v=mTdutcB35js\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/mTdutcB35js\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>\n<p>The main lesson learned: don't try to innovate if you only have 3 hours to make a game from scratch 😄. Mixing tile-based movement with physics (with no previous relevant experience) was way too ambitious, so by the time I got most features working I only had a few minutes to do level design, which is suboptimal to say the least.</p>\n<p>Still, I can call it a prototype I guess, so ka-ching, I'm incrementing the game counter for <a href=\"https://gamedev.fodi.be/2023-recap-and-a-new-challenge/\">my 2024 challenge</a> with <a href=\"https://fodi.itch.io/trijam-267\" target=\"_blank\" rel=\"noopener noreferrer\">Untitled Digging Game</a>. It's buggy, it's super short, but I learned new things while making it and hopefully I'm getting better at streaming in English too.</p>\n<p>I highly recommend <a href=\"https://trijam.itch.io/\" target=\"_blank\" rel=\"noopener noreferrer\">TriJam</a> to any fellow game developers, it's a hoot, it's on every weekend and the 3-hour limit is more of a recommendation anyway - unless you are literally starting 3 hours before the deadline like I did this time 😁.</p>",
            "image": "https://gamedev.fodi.be/media/posts/52/udg2.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Prototype phase",
                   "Projects",
                   "2024"
            ],
            "date_published": "2024-05-09T15:24:04+02:00",
            "date_modified": "2024-05-23T18:13:47+02:00"
        },
        {
            "id": "https://gamedev.fodi.be/attractaball-hej-2024-march-jam/",
            "url": "https://gamedev.fodi.be/attractaball-hej-2024-march-jam/",
            "title": "Attractaball (HEJ 2024 March jam)",
            "summary": "Our second entry for the Hungarian \"one-game-a-month\" jam bears a passing resemblance to a previous project of mine, Windy Physics.",
            "content_html": "<p>Our second entry for the Hungarian \"one-game-a-month\" jam bears a passing resemblance to a previous project of mine, Windy Physics. But this time, you are the wind! Sort of.</p>\n<p>In this action platformer (with minor puzzle elements) you (singular... OR plural!) control a whirl (wheel?) of magnetic (magic?) energy, that collides with most things, but not with the small googly eyed balls that spawn on every level. Your task is to guide the little ones to exit portals; sometimes just one, sometimes a whole school of them.</p>\n<p>One of the themes for the jam was \"Rube Goldberg machine\", which we contemplated using at first, but then we abandoned the idea of making something along the lines of The Incredible Machine and shifted towards the second theme, \"weight/crowd\". As in a crowd of bouncy balls with different weights (blue ones are heavier and more stiff, pink ones are lighter and a lot more bouncy).</p>\n<p>The jam version has no touch input support, so you're going to need a trusty mouse and/or a gamepad(s; did I mention it has co-operative multiplayer for up to 3 people?) to control this one, although it's possible that post-jam updates might add touch controls. But at first we want to add some more levels and a few more mechanics; so stay tuned.</p>\n<p>You can find Attractaball on Itch. Don't forget to switch to full screen mode (by pressing F) if you are using mouse input! I kinda forgot to mention that in-game... :)</p>",
            "image": "https://gamedev.fodi.be/media/posts/51/attractaball.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Prototype phase",
                   "Projects",
                   "2024"
            ],
            "date_published": "2024-04-08T17:48:41+02:00",
            "date_modified": "2024-05-09T15:24:09+02:00"
        },
        {
            "id": "https://gamedev.fodi.be/tips-for-c3-developers/",
            "url": "https://gamedev.fodi.be/tips-for-c3-developers/",
            "title": "Tips for Construct 3 developers",
            "summary": "<p>I have a growing number of practices I usually follow when working on Construct 3 projects. Some of them I've seen elsewhere, some I came up with. Warning: opinionated content. I'm not saying these are \"best practices\", but you might find some of them useful.</p>\n",
            "content_html": "<p>I have a growing number of practices I usually follow when working on Construct 3 projects. Some of them I've seen elsewhere, some I came up with. Warning: opinionated content. I'm not saying these are \"best practices\", but you might find some of them useful.</p>\n\n<div class=\"post__toc\">\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#mcetoc_1htk1ijds14\">Sheet organization</a></li>\n<li><a href=\"#mcetoc_1htk1ijds15\">Using \"macros\"</a></li>\n<li><a href=\"#mcetoc_1htk1ijds16\">Footguns</a>\n<ul>\n<li><a href=\"#mcetoc_1irpup50ti\">Picking instances</a></li>\n<li><a href=\"#mcetoc_1irpup50tj\">Other stuff</a></li>\n</ul>\n</li>\n<li><a href=\"#mcetoc_1htk33g5r4u\">Keyboard shortcuts</a></li>\n<li><a href=\"#mcetoc_1htk33g5r4v\">Embrace the web platform</a></li>\n<li><a href=\"#mcetoc_1htk33g5r4v\">Useful tools</a></li>\n</ul>\n</div>\n<h2 id=\"mcetoc_1htk1ijds14\">Sheet organization</h2>\n<p>I usually have 4 event sheet folders in my projects: <strong>Actions</strong>, <strong>Events</strong>, <strong>Functions</strong> and <strong>Values</strong>.</p>\n<p>The <strong>Actions </strong>folder contains sheets prefixed with the letter \"a\", eg. <strong>aPlayer</strong>, <strong>aEnemies</strong>, <strong>aPortals. </strong>These sheets only contain custom actions for one object type or family only and are named after the relevant object type or family. Common custom actions include:</p>\n<ul>\n<li><strong>spawn:</strong> to dynamically spawn objects during runtime. This usually contains a \"create object\" action and then a call to the <strong>init</strong> custom action of the same object / family.</li>\n<li><strong>init:</strong> initialize variables / behaviours of the object right after it's spawned (or later if the object needs to be \"reset\" at any point). This is similar to _ready in Godot.</li>\n<li><strong>tick:</strong> if an object needs to be constantly \"updated\", I call this custom action at every tick. This is similar to _process in Godot.</li>\n</ul>\n<p>The <strong>Events </strong>folder contains sheets prefixed with the letter \"e\". Each sheet only has events with primary conditions of a certain \"category\". Some examples:</p>\n<ul>\n<li><strong>eCreated:</strong> \"on X created\" events</li>\n<li><strong>eCollisions:</strong> \"on collision with\" and \"is overlapping\" events</li>\n<li><strong>eCycles:</strong> \"on start of layout\", \"every tick\" and \"every X seconds\" events</li>\n<li><strong>eInput:</strong> keyboard / gamepad / mouse / touch events</li>\n<li><strong>eMovement:</strong> events with conditions of movement behaviours</li>\n</ul>\n<p>The <strong>Functions </strong>folder has sheets prefixed with the letter \"f\". These sheets only contain functions of a certain \"category\". Some examples:</p>\n<ul>\n<li><strong>fLevel:</strong> level initialization, win / lose condition handling, pause, etc</li>\n<li><strong>fAudio:</strong> functions that play/stop background music and sound effects</li>\n<li><strong>fUtilities:</strong> helper functions like toggleFullscreen, toggleLayer; maths &amp; formatting utilities, et cetera</li>\n</ul>\n<p>The <strong>Values</strong> folder has exactly 3 sheets that only contain global variables or constants in them:</p>\n<ul>\n<li><strong>vState:</strong> for global game state related variables</li>\n<li><strong>vConfig:</strong> global constants (I prefix those with \"C_\"), these are magic numbers / strings.</li>\n<li><strong>vNames:</strong> global constants that kinda act like enums - more on that later :)</li>\n<li><strong>vPrimitives</strong>: a fixed set of global constants\n<ul>\n<li>YES and NO: numbers 1 and 0, I use them instead of booleans*.</li>\n<li>NOTHING: the number -1: when I use variables that store object UIDs, I use this to \"reset\" them or to determine if they contain a UID or not (UIDs are never -1).</li>\n<li>EMPTY: an empty string, similar to NOTHING but for string variables.</li>\n</ul>\n</li>\n</ul>\n<p class=\"msg msg--highlight \"><strong>* Why I don't use booleans in Construct 3</strong><br>My slight beef is that I can't pass a dynamic value to a function or custom action with a boolean parameter: when calling it, I have to use a checkbox to either pass true or false, I cannot pass a result of an expression or just a variable. Because of this I refrain from using boolean parameters in functions and custom actions, instead I use numbers. Also, AFAIK Construct 3 internally uses the numbers (0 and 1) instead of JavaScript booleans, so there probably isn't a big difference in memory use for using booleans in event sheets. But even if there is, I prefer the better DX in most cases.</p>\n<p>If you want to give my organization system a go, you can <a href=\"https://github.com/fodi/construct-3-projects/tree/main/projectfolders/BlankTemplate\" target=\"_blank\" rel=\"noopener noreferrer\">download my template</a> that I almost always use for new projects.</p>\n<p>Event sheets that are not in a subfolder are assigned to layouts. Usually I have one called<span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">Level</strong><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> (or </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">Main</strong><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">) that includes all sheets in the </span><strong><span style=\"font-family: var(--editor-font-family); font-size: inherit;\">Events</span></strong><span style=\"font-family: var(--editor-font-family); font-size: inherit;\"> folder and nothing else;</span><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> there's no need to include sheets from the other folders, custom actions, functions and global variables / constants are always available. This sheet is set as the \"Event sheet\" on all level layouts. For menu screens I usually use a separate layout with its own event sheet.</span></p>\n<p>I suffix all sheet names with emojis (pro tip for Windows devs: press Win + comma to open the emoji panel), so I can find them more easily when I have a metric crapton of tabs open.</p>\n<p class=\"msg msg--highlight \"><strong>Tangential sidenote</strong><br>Using emojis in names of C3 primitives and project folders instead of single file (.c3p) projects means that you'll have file names on your filesystem that contain emojis. NTFS on Windows 10 seems to handle that without problems, but your mileage might vary on Linux or Mac filesystems. You might also have issues if you store project folders in Dropbox, as it will refuse to sync those files. Because of that, I went back to saving my projects in .c3p files and storing those in Dropbox. Dropbox saved my bacon a few times when I've accidentally saved or overwritten a project, as it keeps previous versions of files (as long as it's able to sync them to their server) which you can restore.</p>\n<p>If you want to give my organization system a go, you can <a href=\"https://github.com/fodi/construct-3-projects/tree/main/projectfolders/BlankTemplate\" target=\"_blank\" rel=\"noopener noreferrer\">download my template</a> that I almost always use for new projects.</p>\n<h2 id=\"mcetoc_1htk1ijds15\">Using \"names\"</h2>\n<p>I try not to use string literals in conditions / actions when referencing animation names, layers, effects, tags and similar identifiers; instead, I use \"names\" , which are global constants defined in the <strong>vNames</strong> sheet. They kinda act like enums, which don't exist in Construct.</p>\n<p>An example: if I have a sprite that has an \"Idle\" and \"Walking\" animation, I create constants named \"ANIM_Idle\" and \"ANIM_Walking\" in the <strong>vNames</strong> sheet with the values \"Idle\" and \"Walking\" respectively, and use those in conditions and actions instead of typing in the string literals \"Idle\" and \"Walking\". Sometimes I also add the name of the related object to the name of the global constant, like \"ANIM_Player_Idle\".</p>\n<p>This has a couple of benefits:</p>\n<ul>\n<li>You get autocompletion that is typo-proof: just start typing the name of the constant wherever you want to use it's value in a condition or action.</li>\n<li>You can use \"Find all references\" to find occurrences of these \"names\".</li>\n<li>If you want to <a href=\"https://martinfowler.com/bliki/TwoHardThings.html\" target=\"_blank\" rel=\"noopener noreferrer\">rename</a> eg. an animation from \"Walking\" to \"Running\", you only have to make the change in two places: the animation editor and the \"name\". This is quicker and less error prone compared to search &amp; replace.</li>\n</ul>\n<h2 id=\"mcetoc_1htk1ijds16\">Footguns</h2>\n<p>Just like with all engines and programming languages, there are a few WTF moments in Construct too, or things that some devs (like yours truly) expect to work in a different way.</p>\n<h3 id=\"mcetoc_1irpup50ti\">Picking instances</h3>\n<p>A good amount of bugs I create are related to screwing up picking conditions: either picking something I don't want to pick, picking the wrong instance or failing to pick something. Here are some suggestions and known footguns related to object instance picking.</p>\n<ul>\n<li>If you only want to pick a single object, make sure that the conditions only pick one. If unsure, add a \"pick nth instance\" condition with the parameter \"0\".</li>\n<li>If you're storing UIDs in (instance) variables, make their default value is a negative number (eg. -1) and not 0, since 0 could be a valid UID since it's zero indexed. To reset such a variable, you can use any negative number (I use the previously mentioned global constant called NOTHING, which has the value -1).</li>\n<li>The Timer behaviour's \"On timer\" condition might pick multiple instances if those instances reach their time in the same tick and you might need to put in an extra \"For each\" to run actions on all of them. <a href=\"https://www.construct.net/en/make-games/manuals/construct-3/behavior-reference/timer\" target=\"_blank\" rel=\"noopener noreferrer\">This is mentioned in a big yellow warning box in the docs by the way.</a></li>\n<li>Functions and custom actions have a similarly named option: \"copy picked\" and \"copy all picked\". If you have a custom action for an object type or family \"X\" and call it from an event that already picked some instances of \"X\", those will be passed on to the custom action even if you don't check \"copy all picked\" (which is for passing other non-\"X\" instances to the custom action). This is by design and makes sense, but can be slightly confusing </li>\n</ul>\n<h3 id=\"mcetoc_1irpup50tj\">Other stuff</h3>\n<ul>\n<li>The int() system expression works like floor() and does not work like parseInt in JavaScript. If you pass it -0.1, it will return -1 instead of 0. There is a related feature request <a href=\"https://github.com/Scirra/Construct-feature-requests/issues/380\" target=\"_blank\" rel=\"noopener noreferrer\">here</a> with more info workarounds.</li>\n</ul>\n<h2 id=\"mcetoc_1htk33g5r4u\">Keyboard shortcuts</h2>\n<p>In event sheets you can do almost everything without touching the mouse. Although I still find myself using it at times, I gained considerable speed by learning <a href=\"https://www.construct.net/en/make-games/manuals/construct-3/interface/keyboard-shortcuts\" target=\"_blank\" rel=\"noopener noreferrer\">the handful of shortcuts</a> for creating events, conditions, (custom) actions, functions, comments, inline scripts, parameters and variables alone.</p>\n<p>You can select events, conditions and actions using the arrow keys (which will also require some practice, but it's totally worth it), toggle breakpoints, bookmarks and disabled state. Navigating the condition / action editor is also fully possible using keyboard shortcuts, and of course you can use the system-wide shortcuts like (Shift+)Tab to jump between fields, Ctrl + left / right arrows to move the cursor in text fields one word at a time and Enter to apply changes. The automatically focused search bar in the condition / action editor is also a godsend, you can just start typing what you're looking for, it's basically a 2D autocomplete that you can also navigate using the arrow keys.</p>\n<h2 id=\"mcetoc_1htk33g5r4v\">Embrace the web platform</h2>\n<p>Construct 3 runs entirely in a browser and you can also <a href=\"https://www.construct.net/en/make-games/manuals/construct-3/getting-started/get-construct-3\" target=\"_blank\" rel=\"noopener noreferrer\">install it as a PWA</a> if you are using Chromium (my choice), Google Chrome, Edge or possibly other Chromium-derived browsers. This means you'll be able to start Construct like you start any other desktop app, use it in an almost full screen window (you can go full screen with F11 if you prefer) and have it associated with the .c3p file type.</p>\n<p>Another great thing is that you can integrate JavaScript libraries in your projects fairly easily, which opens up a lot of cool possibilities. Some examples of libraries I've glued in previously:</p>\n<ul>\n<li><a href=\"https://github.com/kchapelier/wavefunctioncollapse\" target=\"_blank\" rel=\"noopener noreferrer\">WaveFunctionCollapse</a> by KChapelier for procedural level generation</li>\n<li><a href=\"https://github.com/damianofalcioni/js-aruco2/\" target=\"_blank\" rel=\"noopener noreferrer\">JS-ARUCO2</a> by DamianoFalcioni &amp; JCMellado for fiducial marker tracking via camera</li>\n<li><a href=\"https://github.com/ondras/rot.js\">rot.js</a> by Ondras for procedural level generation (and more)</li>\n<li><a href=\"https://github.com/mapbox/pixelmatch/\" target=\"_blank\" rel=\"noopener noreferrer\">Pixelmatch</a> by Mapbox for comparing the contents of Drawing Canvas objects</li>\n<li><a href=\"https://github.com/soimy/maxrects-packer\" target=\"_blank\" rel=\"noopener noreferrer\">Max Rects Packer</a> by Soimy for bin packing objects</li>\n<li>The official <a href=\"https://developers.google.com/youtube/iframe_api_reference\" target=\"_blank\" rel=\"noopener noreferrer\">YouTube IFrame Player API</a> for controlling YouTube embeds</li>\n</ul>\n<p>And since Construct projects are JavaScript apps, you can also use the developer tools in your browser, including the console: the stock Browser plugin / object has actions that write to the console, but of course you can use console.log() and friends in code blocks or the code editor as well.</p>\n<h2 id=\"mcetoc_1htk33g5r4v\">Useful tools</h2>\n<p>Here are a few external tools that you might found useful:</p>\n<ul>\n<li><a href=\"https://stmn.itch.io/font2bitmap\" target=\"_blank\" rel=\"noopener noreferrer\">Font To Bitmap Converter</a>: generates sprite sheets and padding data you can use with the Sprite Font plugin</li>\n<li><a href=\"https://plugins.buy-instant-html5games.com/tools/construct-3-icons-generator/\" target=\"_blank\" rel=\"noopener noreferrer\">Construct 3 Icon Generator</a>: generate all icons for your project from a single image</li>\n<li><a href=\"https://fodi.github.io/construct-3-projects/ConstructColorConverter/\" target=\"_blank\" rel=\"noopener noreferrer\">Construct Color Converter</a>: convert hexadecimal color codes to Constuct's ColorValue format, or global constant declarations you can paste in your project</li>\n</ul>",
            "image": "https://gamedev.fodi.be/media/posts/50/construct-3-organization-tips.png",
            "author": {
                "name": "Fodi"
            },
            "tags": [
            ],
            "date_published": "2024-04-04T16:56:59+02:00",
            "date_modified": "2025-05-27T17:46:15+02:00"
        },
        {
            "id": "https://gamedev.fodi.be/music-miner-marty-hej-2024-feb-jam/",
            "url": "https://gamedev.fodi.be/music-miner-marty-hej-2024-feb-jam/",
            "title": "Music Miner Marty (HEJ 2024 Feb jam)",
            "summary": "We finally ventured into rhythm game territory, which has been on the Lasermagnet Games todo list for quite some time.",
            "content_html": "<p>We finally ventured into rhythm game territory, which has been on the Lasermagnet Games todo list for quite some time. </p>\n<p>After skipping the <a href=\"https://itch.io/jam/hej-2024-jan\" target=\"_blank\" rel=\"noopener noreferrer\">January</a> edition of the Hungarian \"<a href=\"https://haviegyjatek.itch.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Havi Egy Játék</a>\" (\"One Game a Month\") jam I was delighted to find out that themes for <a href=\"https://itch.io/jam/hej-2024-februar\" target=\"_blank\" rel=\"noopener noreferrer\">February</a> included \"on the beat\", which served as an excellent excuse to finally make a rhythm game. Tibor came up with the idea to make something like SteamWorld Dig / Spelunky but with a musical twist: swinging the pickaxe in sync with the beat.</p>\n<p>We started making the game on the 29th of February (thank frack it was a leap year :) and had a relatively cozy deadline of March 5th to finish. About 70% of the process was also streamed <a href=\"https://www.twitch.tv/fodi_gamedev\" target=\"_blank\" rel=\"noopener noreferrer\">on my Twitch</a>, but I'm not sure I'll upload the archives this time.</p>\n<p><a href=\"https://lasermagnet.itch.io/music-miner-marty\" target=\"_blank\" rel=\"noopener noreferrer\">Music Miner Marty is available on Itch</a>, it already received a post-jam update (bugfixes and UX improvements only so far), the original <a href=\"https://lasermagnet.github.io/games/music-miner-marty-jam-version/\" target=\"_blank\" rel=\"noopener noreferrer\">jam version can be found here</a> for reference.</p>\n<p>And here's a little gameplay:</p>\n<p><a href=\"https://www.youtube.com/watch?v=gr_IzilGUKQ\"><div class=\"post__iframe\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/gr_IzilGUKQ\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"allowfullscreen\"></iframe></div></a></p>\n<p>Naturally we have a bunch of ideas we might try to add later (combos, tougher blocks, touch input support, enemies, falling blocks, et cetera), but no promises of course :)</p>",
            "image": "https://gamedev.fodi.be/media/posts/48/mmm.jpg",
            "author": {
                "name": "Fodi"
            },
            "tags": [
                   "Prototype phase",
                   "Projects",
                   "2024"
            ],
            "date_published": "2024-03-14T12:08:58+01:00",
            "date_modified": "2024-04-05T14:32:25+02:00"
        }
    ]
}
